using Revise
using MacroModelling

# include("../test/models/RBC_CME_calibration_equations_and_parameter_definitions_and_specfuns.jl")
# 𝓂 = m

# include("../models/Smets_Wouters_2003.jl")
# 𝓂 = Smets_Wouters_2003

include("../models/Smets_Wouters_2007.jl")
𝓂 = Smets_Wouters_2007

stst = SS(𝓂, derivatives = false)
sum(abs,stst) # 153.25700896899727
get_solution(𝓂)

sum(abs,𝓂.jacobian[1]) # 3727.9291798016457
# RBC_CME_calibration_equations_and_parameter_definitions_and_specfuns 40.19955622201187
𝓂.jacobian[1][13,:]

𝓂.jacobian[1].nzval[72]

𝔙 = 𝓂.solution.non_stochastic_steady_state
𝔓 = 𝓂.parameter_values


import MacroModelling: get_symbols, match_pattern, replace_symbols
using Symbolics


    future_varss  = collect(reduce(union,match_pattern.(get_symbols.(𝓂.dyn_equations),r"₍₁₎$")))
    present_varss = collect(reduce(union,match_pattern.(get_symbols.(𝓂.dyn_equations),r"₍₀₎$")))
    past_varss    = collect(reduce(union,match_pattern.(get_symbols.(𝓂.dyn_equations),r"₍₋₁₎$")))
    shock_varss   = collect(reduce(union,match_pattern.(get_symbols.(𝓂.dyn_equations),r"₍ₓ₎$")))
    ss_varss      = collect(reduce(union,match_pattern.(get_symbols.(𝓂.dyn_equations),r"₍ₛₛ₎$")))

    sort!(future_varss  ,by = x->replace(string(x),r"₍₁₎$"=>"")) #sort by name without time index because otherwise eps_zᴸ⁽⁻¹⁾₍₋₁₎ comes before eps_z₍₋₁₎
    sort!(present_varss ,by = x->replace(string(x),r"₍₀₎$"=>""))
    sort!(past_varss    ,by = x->replace(string(x),r"₍₋₁₎$"=>""))
    sort!(shock_varss   ,by = x->replace(string(x),r"₍ₓ₎$"=>""))
    sort!(ss_varss      ,by = x->replace(string(x),r"₍ₛₛ₎$"=>""))

    dyn_future_list = collect(reduce(union, 𝓂.dyn_future_list))
    dyn_present_list = collect(reduce(union, 𝓂.dyn_present_list))
    dyn_past_list = collect(reduce(union, 𝓂.dyn_past_list))
    dyn_exo_list = collect(reduce(union,𝓂.dyn_exo_list))
    dyn_ss_list = Symbol.(string.(collect(reduce(union,𝓂.dyn_ss_list))) .* "₍ₛₛ₎")

    future = map(x -> Symbol(replace(string(x), r"₍₁₎" => "")),string.(dyn_future_list))
    present = map(x -> Symbol(replace(string(x), r"₍₀₎" => "")),string.(dyn_present_list))
    past = map(x -> Symbol(replace(string(x), r"₍₋₁₎" => "")),string.(dyn_past_list))
    exo = map(x -> Symbol(replace(string(x), r"₍ₓ₎" => "")),string.(dyn_exo_list))
    stst = map(x -> Symbol(replace(string(x), r"₍ₛₛ₎" => "")),string.(dyn_ss_list))

    vars_raw = vcat(dyn_future_list[indexin(sort(future),future)],
                    dyn_present_list[indexin(sort(present),present)],
                    dyn_past_list[indexin(sort(past),past)],
                    dyn_exo_list[indexin(sort(exo),exo)])

    dyn_var_future_idx = 𝓂.solution.perturbation.auxiliary_indices.dyn_var_future_idx
    dyn_var_present_idx = 𝓂.solution.perturbation.auxiliary_indices.dyn_var_present_idx
    dyn_var_past_idx = 𝓂.solution.perturbation.auxiliary_indices.dyn_var_past_idx
    dyn_ss_idx = 𝓂.solution.perturbation.auxiliary_indices.dyn_ss_idx

    dyn_var_idxs = vcat(dyn_var_future_idx, dyn_var_present_idx, dyn_var_past_idx)

    pars_ext = vcat(𝓂.parameters, 𝓂.calibration_equations_parameters)
    parameters_and_SS = vcat(pars_ext, dyn_ss_list[indexin(sort(stst),stst)])

    np = length(parameters_and_SS)
    nv = length(vars_raw)
    nc = length(𝓂.calibration_equations)
    nps = length(𝓂.parameters)
    nxs = maximum(dyn_var_idxs) + nc


Symbolics.@variables 𝔓[1:np] 𝔙[1:nv]



    parameter_dict = Dict{Symbol, Symbol}()
    back_to_array_dict = Dict{Symbolics.Num, Symbolics.Num}()
    calib_vars = Symbol[]
    calib_expr = []
    SS_mapping = Dict{Symbolics.Num, Symbolics.Num}()


    for (i,v) in enumerate(parameters_and_SS)
        push!(parameter_dict, v => :($(Symbol("𝔓_$i"))))
        push!(back_to_array_dict, Symbolics.parse_expr_to_symbolic(:($(Symbol("𝔓_$i"))), @__MODULE__) => 𝔓[i])
        if i > nps
            if i > length(pars_ext)
                push!(SS_mapping, 𝔓[i] => 𝔙[dyn_ss_idx[i-length(pars_ext)]])
            else
                push!(SS_mapping, 𝔓[i] => 𝔙[nxs + i - nps - nc])
            end
        end
    end

    for (i,v) in enumerate(vars_raw)
        push!(parameter_dict, v => :($(Symbol("𝔙_$i"))))
        push!(back_to_array_dict, Symbolics.parse_expr_to_symbolic(:($(Symbol("𝔙_$i"))), @__MODULE__) => 𝔙[i])
        if i <= length(dyn_var_idxs)
            push!(SS_mapping, 𝔙[i] => 𝔙[dyn_var_idxs[i]])
        else
            push!(SS_mapping, 𝔙[i] => 0)
        end
    end


    for v in 𝓂.calibration_equations_no_var
        push!(calib_vars, v.args[1])
        push!(calib_expr, v.args[2])
    end


    calib_replacements = Dict{Symbol,Any}()
    for (i,x) in enumerate(calib_vars)
        replacement = Dict(x => calib_expr[i])
        for ii in i+1:length(calib_vars)
            calib_expr[ii] = replace_symbols(calib_expr[ii], replacement)
        end
        push!(calib_replacements, x => calib_expr[i])
    end

𝓂.dyn_equations[[13]] |> 
        x -> replace_symbols.(x, Ref(calib_replacements)) |> 
        x -> replace_symbols.(x, Ref(parameter_dict)) |> 
        x -> Symbolics.parse_expr_to_symbolic.(x, Ref(@__MODULE__)) |>
        x -> Symbolics.substitute.(x, Ref(back_to_array_dict))

        
expr_to_parse = :(𝔙_82 - exp(((𝔓_7 - 1) / (1 + 𝔓_13)) * ((𝔙_57 * ((𝔓_5 * (1 - 𝔓_2)) / 𝔓_2 + 𝔙_78)) / (1 + (𝔓_5 * (1 - 𝔓_2)) / 𝔓_2)) ^ (1 + 𝔓_13)) * (𝔙_34 - (𝔙_91 * 𝔓_11) / (1 + 𝔓_34 / 100)) ^ -𝔓_7)

Symbolics.parse_expr_to_symbolic(expr_to_parse, @__MODULE__)

dyn_equations = Symbolics.Num[(-𝔙[100]*𝔙[29]) / (1 + 𝔓[34] / 100) - 𝔙[34] - 𝔙[51] + 𝔙[84] - 𝔓[49]*𝔙[50], (((𝔓[4]*(1 - 𝔓[8])) / 𝔓[8] + 𝔙[62])*𝔙[84]) / (1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8]) + 𝔓[49]*(-1 + 𝔓[8]) - (𝔙[57]^(1 - 𝔓[6]))*(𝔙[53]^𝔓[6])*𝔙[28], (-𝔙[100]*𝔙[87]) / (1 + 𝔓[34] / 100) + 𝔙[53], (-(1 - 𝔓[1])*𝔙[100]) / (1 + 𝔓[34] / 100) + 𝔙[55] - (1 - 𝔙[24])*𝔙[51]*𝔙[68], (-(𝔙[23]^((-(1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*(1 - 𝔓[14])) / (𝔙[38]^((-(1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8]))) + (-(((𝔙[105]^𝔓[16])*(𝔓[43]^(1 - 𝔓[16]))*𝔙[93])^((-(1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*𝔓[14]*𝔙[103]) / ((𝔙[38]*𝔙[64])^((-(1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8]))) + 𝔙[62], (-(((𝔓[43]^(1 - 𝔓[15]))*(𝔙[105]^𝔓[15])*𝔙[94])^((-(1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*𝔓[12]*𝔙[111]) / ((𝔙[39]*𝔙[64])^((-(1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2]))) + (-(𝔙[81]^((-(1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*(1 - 𝔓[12])) / (𝔙[39]^((-(1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2]))) + 𝔙[78], 1 + (-(((𝔙[105]^𝔓[16])*(𝔓[43]^(1 - 𝔓[16]))*𝔙[93])^((-1 - 𝔓[4]*(1 - 𝔓[8])) / (-1 + 𝔓[8])))*𝔓[14]) / ((𝔙[38]*𝔙[64])^((-1 - 𝔓[4]*(1 - 𝔓[8])) / (-1 + 𝔓[8]))) + (-(𝔙[23]^((-1 - 𝔓[4]*(1 - 𝔓[8])) / (-1 + 𝔓[8])))*(1 - 𝔓[14])) / (𝔙[38]^((-1 - 𝔓[4]*(1 - 𝔓[8])) / (-1 + 𝔓[8]))), 1 + (-(𝔙[81]^((-1 - (1 - 𝔓[2])*𝔓[5]) / (-1 + 𝔓[2])))*(1 - 𝔓[12])) / (𝔙[39]^((-1 - (1 - 𝔓[2])*𝔓[5]) / (-1 + 𝔓[2]))) + (-(((𝔓[43]^(1 - 𝔓[15]))*(𝔙[105]^𝔓[15])*𝔙[94])^((-1 - (1 - 𝔓[2])*𝔓[5]) / (-1 + 𝔓[2])))*𝔓[12]) / ((𝔙[39]*𝔙[64])^((-1 - (1 - 𝔓[2])*𝔓[5]) / (-1 + 𝔓[2]))), 1 + (-(1 + (𝔓[4]*(1 - 𝔓[8])*𝔙[63]) / 𝔓[8])*𝔙[38]) / (1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8]), (-(1 + ((1 - 𝔓[2])*𝔓[5]*𝔙[79]) / 𝔓[2])*𝔙[39]) / (1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2]) + 𝔙[77], (-(1 - 𝔓[14])*𝔙[23]) / 𝔙[38] + (-(𝔙[105]^𝔓[16])*(𝔓[43]^(1 - 𝔓[16]))*𝔓[14]*𝔙[104]*𝔙[93]) / (𝔙[38]*𝔙[64]) + 𝔙[63], (-(1 - 𝔓[12])*𝔙[81]) / 𝔙[39] + (-(𝔓[43]^(1 - 𝔓[15]))*(𝔙[105]^𝔓[15])*𝔓[12]*𝔙[112]*𝔙[94]) / (𝔙[39]*𝔙[64]) + 𝔙[79], 𝔙[82] - exp(((((((1 - 𝔓[2])*𝔓[5]) / 𝔓[2] + 𝔙[78])*𝔙[57])^(1 + 𝔓[13]))*(-1 + 𝔓[7])) / (((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])^(1 + 𝔓[13]))*(1 + 𝔓[13])))*(((-𝔓[11]*𝔙[91]) / (1 + 𝔓[34] / 100) + 𝔙[34])^(-𝔓[7])), 1 + (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*((1 + 𝔓[34] / 100)^2)*𝔙[1]*(𝔙[11]^2)*𝔙[14]*𝔙[19]*𝔙[69]) / ((1 + 𝔓[33] / 100)*(𝔙[51]^2)*𝔙[82]) - (1 + (-(1 + 𝔓[34] / 100)*𝔙[25]*𝔙[51]) / 𝔙[98] - 𝔙[24])*𝔙[66]*𝔙[68], (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔙[19]*𝔙[33]*𝔙[70]) / ((1 + 𝔓[33] / 100)*𝔙[13]) + 𝔙[82], -𝔙[30] + 𝔙[71], (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*(-𝔙[3] + (1 - 𝔓[1])*𝔙[14] + 𝔙[17]*𝔙[21])*𝔙[19]) / ((1 + 𝔓[33] / 100)*𝔙[82]) + 𝔙[66], (-𝔓[6]*𝔙[57]*𝔙[77]) / ((1 - 𝔓[6])*𝔙[71]) + 𝔙[53], (-(𝔙[71]^𝔓[6])*(𝔙[77]^(1 - 𝔓[6]))) / ((𝔓[6]^𝔓[6])*((1 - 𝔓[6])^(1 - 𝔓[6]))*𝔙[28]) + 𝔙[60], (-(𝔙[81]^(1 + ((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*(-1 + 𝔓[2])*(1 - 𝔓[2])*𝔓[5]*𝔙[49]) / ((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) + ((1 + (1 - 𝔓[2])*𝔓[5])*𝔙[47]*𝔙[81]) / (1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2]) - 𝔓[2]*𝔙[48], (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*(((𝔙[64]^𝔓[15])*(𝔓[43]^(1 - 𝔓[15])))^((-1 - (1 - 𝔓[2])*𝔓[5]) / (-1 + 𝔓[2])))*𝔓[12]*(1 + 𝔓[34] / 100)*𝔙[19]*𝔙[8]) / ((𝔙[13]^((-1 - (1 - 𝔓[2])*𝔓[5]) / (-1 + 𝔓[2])))*(1 + 𝔓[33] / 100)*𝔙[82]) + 𝔙[47] - (𝔙[39]^(((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*𝔙[57], (-(((𝔙[64]^𝔓[15])*(𝔓[43]^(1 - 𝔓[15])))^((-(1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[12]*(1 + 𝔓[34] / 100)*𝔙[19]*𝔙[9]) / ((𝔙[13]^((-(1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*(1 + 𝔓[33] / 100)*𝔙[82]) + (-((-𝔓[11]*𝔙[91]) / (1 + 𝔓[34] / 100) + 𝔙[34])*(((((1 - 𝔓[2])*𝔓[5]) / 𝔓[2] + 𝔙[78])*𝔙[57])^𝔓[13])*(𝔙[39]^(((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) / (-1 + 𝔓[2])))*𝔙[57]*𝔙[76]) / ((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])^𝔓[13]) + 𝔙[48], (-(𝔙[64]^𝔓[15])*(𝔓[43]^(1 - 𝔓[15]))*((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[12]*(1 + 𝔓[34] / 100)*𝔙[10]*𝔙[19]) / ((1 + 𝔓[33] / 100)*𝔙[13]*𝔙[82]) + 𝔙[49] - 𝔙[57], (-(𝔙[23]^(1 + ((1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*𝔓[4]*(-1 + 𝔓[8])*(1 - 𝔓[8])*𝔙[46]) / ((1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) + ((1 + 𝔓[4]*(1 - 𝔓[8]))*𝔙[23]*𝔙[44]) / (1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8]) - 𝔓[8]*𝔙[45], (-(((𝔙[64]^𝔓[16])*(𝔓[43]^(1 - 𝔓[16])))^((-1 - 𝔓[4]*(1 - 𝔓[8])) / (-1 + 𝔓[8])))*((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[14]*(1 + 𝔓[34] / 100)*𝔙[19]*𝔙[5]) / ((𝔙[13]^((-1 - 𝔓[4]*(1 - 𝔓[8])) / (-1 + 𝔓[8])))*(1 + 𝔓[33] / 100)*𝔙[82]) + 𝔙[44] - (𝔙[38]^(((1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*𝔙[84], (-(((𝔙[64]^𝔓[16])*(𝔓[43]^(1 - 𝔓[16])))^((-(1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[14]*(1 + 𝔓[34] / 100)*𝔙[19]*𝔙[6]) / ((𝔙[13]^((-(1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*(1 + 𝔓[33] / 100)*𝔙[82]) + 𝔙[45] - (𝔙[38]^(((1 + (𝔓[4]*(1 - 𝔓[8])) / 𝔓[8])*𝔓[8]) / (-1 + 𝔓[8])))*𝔙[60]*𝔙[75]*𝔙[84], (-(𝔙[64]^𝔓[16])*(𝔓[43]^(1 - 𝔓[16]))*((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[14]*(1 + 𝔓[34] / 100)*𝔙[19]*𝔙[7]) / ((1 + 𝔓[33] / 100)*𝔙[13]*𝔙[82]) + 𝔙[46] - 𝔙[84], -𝔙[16] + 𝔙[69], (-(𝔙[84]^((1 - 𝔓[19])*𝔓[20]))*(𝔙[107]^𝔓[19])*((𝔙[114]*𝔙[84])^𝔓[21])*(𝔙[64]^(𝔓[18]*(1 - 𝔓[19])))*(𝔓[45]^(1 - 𝔓[19]))*𝔙[61]) / ((𝔓[43]^(𝔓[18]*(1 - 𝔓[19])))*(𝔙[85]^((1 - 𝔓[19])*𝔓[20]))*((𝔙[113]*𝔙[85])^𝔓[21])) + 𝔙[70], (-(-1 + exp((𝔓[17]*(-1 + 𝔙[87])) / (1 - 𝔓[17])))*(1 - 𝔓[17])*𝔓[46]) / 𝔓[17] + 𝔙[29], 𝔙[30] - exp((𝔓[17]*(-1 + 𝔙[87])) / (1 - 𝔓[17]))*𝔓[46], 𝔙[24] - (1//2)*((-1 + ((1 + 𝔓[34] / 100)*𝔙[51]) / 𝔙[98] - (1//100)*𝔓[34])^2)*𝔓[10], 𝔙[25] - (-1 + ((1 + 𝔓[34] / 100)*𝔙[51]) / 𝔙[98] - (1//100)*𝔓[34])*𝔓[10], -1 + 𝔓[22] + 𝔙[28] - 𝔓[22]*𝔙[89] - (1//100)*𝔓[35]*𝔙[115], -1 + ((1 + 𝔓[11] / (1 + 𝔓[34] / 100))*𝔓[36]*𝔓[7]*𝔙[116]) / (100(1 + (-𝔓[11]) / (1 + 𝔓[34] / 100))) + 𝔓[23] + 𝔙[33] - 𝔓[23]*𝔙[90], -𝔓[3] + 𝔙[50] - 𝔓[24]*(-𝔓[3] + 𝔙[97]) - (1//100)*𝔓[37]*𝔙[117] - (1//100)*𝔓[35]*𝔓[9]*𝔙[115], -1 + 𝔓[25] + 𝔙[68] - 𝔓[25]*𝔙[106] - (1//100)*(1 + ((1 + 𝔓[34] / 100)^(1 - 𝔓[7])) / (1 + 𝔓[33] / 100))*𝔓[10]*((1 + 𝔓[34] / 100)^2)*𝔓[40]*𝔙[120], -1 + 𝔓[26] + 𝔙[61] - 𝔓[26]*𝔙[102] - (1//100)*𝔓[38]*𝔙[118], -1 + 𝔓[27] - 𝔙[42] + 𝔙[75] - 𝔓[27]*𝔙[108] + 𝔓[29]*𝔙[95], (-(1 + (((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[16]*(1 + 𝔓[34] / 100)) / (1 + 𝔓[33] / 100))*𝔓[14]*(1 + 𝔓[4]*(-1 + 𝔓[8]))*𝔓[41]*𝔙[119]) / (100(1 + (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[14]*(1 + 𝔓[34] / 100)) / (1 + 𝔓[33] / 100))*(1 - 𝔓[14])) + 𝔙[42], -1 + 𝔓[28] - 𝔙[43] + 𝔙[76] - 𝔓[28]*𝔙[109] + 𝔓[30]*𝔙[96], (-(1 + (((1 + 𝔓[34] / 100)^(-𝔓[7]))*(1 + 𝔓[34] / 100)) / (1 + 𝔓[33] / 100))*𝔓[12]*(1 + (-1 + 𝔓[2])*𝔓[5])*𝔓[39]*𝔙[121]) / (100(1 + (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔓[12]*(1 + 𝔓[34] / 100)) / (1 + 𝔓[33] / 100))*(1 - 𝔓[12])) + 𝔙[43], (-𝔙[101]*𝔙[32]) / (1 + 𝔓[34] / 100) - 𝔙[35] - 𝔙[52] + 𝔙[85] - 𝔓[50]*𝔙[50], 𝔙[85] + 𝔓[50]*(-1 + 𝔓[8]) - (𝔙[58]^(1 - 𝔓[6]))*(𝔙[54]^𝔓[6])*𝔙[28], (-𝔙[101]*𝔙[88]) / (1 + 𝔓[34] / 100) + 𝔙[54], (-(1 - 𝔓[1])*𝔙[101]) / (1 + 𝔓[34] / 100) + 𝔙[56] - (1 - 𝔙[27])*𝔙[52]*𝔙[68], 𝔙[83] - (((-𝔓[11]*𝔙[92]) / (1 + 𝔓[34] / 100) + 𝔙[35])^(-𝔓[7]))*exp(((𝔙[58]^(1 + 𝔓[13]))*(-1 + 𝔓[7])) / (1 + 𝔓[13])), 1 + (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*((1 + 𝔓[34] / 100)^2)*(𝔙[12]^2)*𝔙[15]*𝔙[2]*𝔙[20]*𝔙[69]) / ((1 + 𝔓[33] / 100)*(𝔙[52]^2)*𝔙[83]) - (1 + (-(1 + 𝔓[34] / 100)*𝔙[26]*𝔙[52]) / 𝔙[99] - 𝔙[27])*𝔙[67]*𝔙[68], (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*𝔙[20]*𝔙[33]*𝔙[74]) / (1 + 𝔓[33] / 100) + 𝔙[83], -𝔙[31] + 𝔙[72], (-((1 + 𝔓[34] / 100)^(-𝔓[7]))*(-𝔙[4] + (1 - 𝔓[1])*𝔙[15] + 𝔙[18]*𝔙[22])*𝔙[20]) / ((1 + 𝔓[33] / 100)*𝔙[83]) + 𝔙[67], (-𝔓[6]*𝔙[58]*𝔙[80]) / ((1 - 𝔓[6])*𝔙[72]) + 𝔙[54], (-(𝔙[80]^(1 - 𝔓[6]))*(𝔙[72]^𝔓[6])) / ((𝔓[6]^𝔓[6])*((1 - 𝔓[6])^(1 - 𝔓[6]))*𝔙[28]) + 𝔓[42], ((1 + (1 - 𝔓[2])*𝔓[5])*𝔙[80]) / (1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2]) - (((-1 + 𝔓[2])*(1 - 𝔓[2])*𝔓[5]*𝔙[80]) / ((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])*𝔓[2]) + (𝔙[58]^𝔓[13])*((-𝔓[11]*𝔙[92]) / (1 + 𝔓[34] / 100) + 𝔙[35])*𝔓[2])*𝔓[48], (-(-1 + exp((𝔓[17]*(-1 + 𝔙[88])) / (1 - 𝔓[17])))*(1 - 𝔓[17])*𝔓[47]) / 𝔓[17] + 𝔙[32], 𝔙[31] - exp((𝔓[17]*(-1 + 𝔙[88])) / (1 - 𝔓[17]))*𝔓[47], 𝔙[27] - (1//2)*((-1 + ((1 + 𝔓[34] / 100)*𝔙[52]) / 𝔙[99] - (1//100)*𝔓[34])^2)*𝔓[10], 𝔙[26] - (-1 + ((1 + 𝔓[34] / 100)*𝔙[52]) / 𝔙[99] - (1//100)*𝔓[34])*𝔓[10], -100log(𝔙[84] / 𝔙[85]) + 𝔙[86], -100(-1 + 𝔙[84] / 𝔙[113]) - 𝔓[34] + 𝔙[41], -100(-1 + 𝔙[34] / 𝔙[91]) - 𝔓[34] + 𝔙[36], -100(-1 + 𝔙[51] / 𝔙[98]) - 𝔓[34] + 𝔙[37], -100(-1 + 𝔙[64]) + 𝔙[65], -100(-1 + 𝔙[70]) + 𝔙[73], -100(-1 + 𝔙[77] / 𝔙[110]) - 𝔓[34] + 𝔙[40], -100(-1 + 𝔙[57] / 𝔓[44]) - 𝔓[31] + 𝔙[59]]

# eq 13:  𝔙[82] - exp(((((((1 - 𝔓[2])*𝔓[5]) / 𝔓[2] + 𝔙[78])*𝔙[57])^(1 + 𝔓[13]))*(-1 + 𝔓[7])) / (((1 + ((1 - 𝔓[2])*𝔓[5]) / 𝔓[2])^(1 + 𝔓[13]))*(1 + 𝔓[13])))*(((-𝔓[11]*𝔙[91]) / (1 + 𝔓[34] / 100) + 𝔙[34])^(-𝔓[7]))
spX_order_1 = Symbolics.sparsejacobian(dyn_equations[[13]], 𝔙) # nϵ x nx
spX_order_1.nzval

((1 - 𝔓[2]) * 𝔓[5] / 𝔓[2] + 𝔙[56]) * 𝔙[35]

(+)(1, (getindex)(𝔓, 13))


(*)((*)((^)((+)((/)((*)((*)(-1, (getindex)(𝔓, 11)), (getindex)(𝔙, 12)), (+)(1, (/)((getindex)(𝔓, 34), 100))), (getindex)(𝔙, 12)), (+)(-1, (*)(-1, (getindex)(𝔓, 7)))), (exp)((/)((*)((^)((*)((+)((/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)), (getindex)(𝔙, 56)), (getindex)(𝔙, 35)), (+)(1, (getindex)(𝔓, 13))), (+)(-1, (getindex)(𝔓, 7))), (*)((^)((+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2))), (+)(1, (getindex)(𝔓, 13))), (+)(1, (getindex)(𝔓, 13)))))), (getindex)(𝔓, 7))

using NaNMath
(*)((*)((^)((+)((/)((*)((*)(-1, (getindex)(𝔓, 11)), (getindex)(𝔙, 12)), (+)(1, (/)((getindex)(𝔓, 34), 100))), (getindex)(𝔙, 12)), (+)(-1, (*)(-1, (getindex)(𝔓, 7)))), (exp)((/)((*)((^)((*)((+)((/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)), (getindex)(𝔙, 56)), (getindex)(𝔙, 35)), (+)(1, (getindex)(𝔓, 13))), (+)(-1, (getindex)(𝔓, 7))), (*)((^)((+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2))), (+)(1, (getindex)(𝔓, 13))), (+)(1, (getindex)(𝔓, 13)))))), (getindex)(𝔓, 7))

(/)((*)((*)((*)((*)(-1, (^)((getindex)(𝔙, 17), (/)((*)((+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2))), (getindex)(𝔓, 2)), (+)(-1, (getindex)(𝔓, 2))))), (^)((*)((+)((/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)), (getindex)(𝔙, 56)), (getindex)(𝔙, 35)), (getindex)(𝔓, 13))), (getindex)(𝔙, 35)), (getindex)(𝔙, 54)), (^)((+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2))), (getindex)(𝔓, 13)))



(*)((*)((exp)((/)((*)((^)((/)((*)((+)((/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)), (getindex)(𝔙, 56)), (getindex)(𝔙, 35)), (+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)))), (+)(1, (getindex)(𝔓, 13))), (+)(-1, (getindex)(𝔓, 7))), (+)(1, (getindex)(𝔓, 13)))), (^)((+)((/)((*)((*)(-1, (getindex)(𝔓, 11)), (getindex)(𝔙, 12)), (+)(1, (*)(1//100, (getindex)(𝔓, 34)))), (getindex)(𝔙, 12)), (+)(-1, (*)(-1, (getindex)(𝔓, 7))))), (getindex)(𝔓, 7))

(*)((*)((*)((*)(-1, (^)((/)((*)((+)((/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)), (getindex)(𝔙, 56)), (getindex)(𝔙, 35)), (+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2)))), (getindex)(𝔓, 13))), (^)((getindex)(𝔙, 17), (/)((*)((+)(1, (/)((*)((+)(1, (*)(-1, (getindex)(𝔓, 2))), (getindex)(𝔓, 5)), (getindex)(𝔓, 2))), (getindex)(𝔓, 2)), (+)(-1, (getindex)(𝔓, 2))))), (getindex)(𝔙, 35)), (getindex)(𝔙, 54))
# 121-element SparseArrays.SparseVector{Float64, Int64} with 5 stored entries:
#   [34]  =  37.8839
#   [57]  =  -6.69165
#   [78]  =  3.72802
#   [82]  =  1.0
#   [91]  =  -24.0024
𝓂.jacobian[2]
# 66×121 SparseArrays.SparseMatrixCSC{Float64, Int64} with 298 stored entries:
# ⎡⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠐⠁⠀⠁⢀⠀⠀⠀⠀⠈⡁⢆⠐⠀⢐⢀⠀⡀⠀⠀⠀⠀⠀⠀⠃⠄⠀⢀⠀⠀⢨⠀⡀⡀⠀⠀⠀⠀⠀⠀⎤
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠀⠀⠀⠀⠀⢐⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⡸⠀⠀⠀⠀⠀⠈⠨⠀⠀⠀⠀⠐⠅⠀⠀⠀⠀⠇⠀⠈⠀⠀⠀⠀⎥
# ⎢⡀⠀⠀⠀⡀⢀⠀⢀⠀⢈⡀⠀⠀⠀⠄⠈⠃⠀⠀⠀⠀⡀⠀⠠⠀⠀⠙⢀⣀⠀⠀⠀⠡⠓⡄⠀⠀⠀⠌⠂⠀⡀⠀⠈⠃⠀⠐⠀⠀⠀⠀⎥
# ⎢⠀⠄⠀⠀⠀⠡⠠⠨⠠⠀⠀⢀⠂⠈⠀⠀⠀⠀⠀⠀⠀⠀⠄⠠⠀⡀⠀⠠⠀⢱⠀⠀⡄⠀⠅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⎥
# ⎢⠀⠀⠀⠢⡀⡆⠀⢰⠀⢀⠀⠀⠀⠀⠄⠀⠆⠀⣀⡘⡅⠀⠀⢰⠀⠀⢰⠀⠀⠀⠀⠠⠠⠈⡆⠀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⎥
# ⎢⠀⠈⠢⠀⠀⠇⢀⠸⠀⠀⠀⠀⠀⠀⠀⠘⠀⠀⠑⠄⠀⠀⠀⠀⠀⠂⠸⠀⢀⠀⠀⠂⠀⠀⠇⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⎥
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⡀⠀⠂⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠈⠈⠀⠀⠁⠀⠀⠀⠀⠀⠉⠂⠀⠀⠀⠀⡄⠀⠀⠈⠀⠀⠉⠀⠀⠀⎥
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠐⠀⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⢀⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠑⠀⠀⠠⠀⢀⠀⠄⠀⠀⠀⠕⡄⠄⎥
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠡⠀⠀⠀⠀⠀⠀⠀⠈⠄⠀⠀⠀⠀⠡⠀⠀⠀⠐⢀⎥
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠌⠀⠁⢈⠀⠀⠀⠀⠀⠈⠨⠘⠄⡁⠀⠀⠀⠄⠀⠀⠀⠀⠀⢀⠈⠐⠀⢀⠀⠀⠀⠇⠀⠀⠀⠀⠀⠀⠀⠀⎥
# ⎢⠈⠠⠀⠀⠈⠀⠅⠄⠇⠄⠈⠁⠐⠐⠀⠀⠀⠀⠀⠀⠀⠈⢀⠀⡀⠀⠀⠀⠍⠀⡒⠀⠀⡀⠸⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⎥
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡈⢀⠄⠐⠀⠀⠀⠀⠀⠀⢀⠀⠀⠂⠀⠀⠀⠀⠀⠁⠀⠀⠃⠀⠀⢠⠀⠐⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⎥
# ⎢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠀⠀⠀⣀⠀⠀⠄⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠖⠂⠀⡀⠀⠀⠁⠀⠀⠀⠀⠀⠄⠀⠀⠀⎥
# ⎣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠠⠀⠀⠀⠀⠁⠀⢀⢀⠀⠈⠁⠀⠂⠐⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠄⠀⠀⠀⠀⎦
import MacroModelling: calculate_jacobian, calculate_first_order_solution



𝓂.dyn_equations[22]

𝓂 = Smets_Wouters_2007

include("../test/models/RBC_CME.jl")
include("../test/models/RBC_CME_calibration_equations_and_parameter_definitions.jl")
𝓂 = m

SS_and_pars, (solution_error, iters) = 𝓂.solution.outdated_NSSS ? get_NSSS_and_parameters(𝓂, 𝓂.parameter_values, opts = opts) : (𝓂.solution.non_stochastic_steady_state, (eps(), 0))

∇₁ = calculate_jacobian(𝓂.parameter_values, SS_and_pars, 𝓂) |> sparse
I, J, V = findnz(∇₁)
nan_pos = [66]#findall(isnan, V)
nan_pos[[1,4,7,9]]

∇₁[13,34]

if isempty(nan_pos)
    println("No NaN entries found")
    []
else
    rows = I[nan_pos]
    cols = J[nan_pos]
    positions = Tuple.(zip(rows, cols))  # (row, col) pairs
    println("NaN at positions (row, col): ", positions)
    positions
end


S₁, qme_sol, solved = calculate_first_order_solution(∇₁; 
                                                    T = 𝓂.timings, 
                                                    # opts = opts,
                                                    initial_guess = 𝓂.solution.perturbation.qme_solution)
    