@model Gali_Monacelli_2005_CITR begin
	x[0] = x[1] - σᵃ ^ (-1) * (r[0] - pih[1] - rnat[0])

	pih[0] = pih[1] * β + x[0] * κᵃ

	rnat[0] = ( - σᵃ) * Γ * (1 - ρᵃ) * a[0] + σᵃ * α * (Θ + Ψ) * (ystar[1] - ystar[0])

	ynat[0] = Γ * a[0] + ystar[0] * α * Ψ

	x[0] = y[0] - ynat[0]

	y[0] = ystar[0] + σᵃ ^ (-1) * s[0]

	pi[0] = pih[0] + α * (s[0] - s[-1])

	s[0] = s[-1] + deprec_rate[0] - pih[0]

	y[0] = a[0] + n[0]

	nx[0] = s[0] * α * (ω / σ - 1)

	y[0] = c[0] + s[0] * α * ω / σ

	real_wage[0] = σ * c[0] + n[0] * ϕ

	a[0] = ρᵃ * a[-1] + ϵ_a[x]

	ystar[0] = ρʸ * ystar[-1] + ϵ_star[x]

	r[0] = pi[0] * ϕᵖⁱ

end


@parameters Gali_Monacelli_2005_CITR begin
	σ = 1

	η = 1

	γ = 1

	ϕ = 3

	θ = 0.75

	β = 0.99

	α = 0.4

	ϕᵖⁱ = 1.5

	ρᵃ = 0.9

	ρʸ = 0.86

	ρ = 1 / β - 1

	ω = σ * γ + (1 - α) * (σ * η - 1)

	σᵃ = σ / (1 - α + α * ω)

	Θ = (1 - α) * (σ * η - 1) + σ * γ - 1

	λ = (1 - β * θ) * (1 - θ) / θ

	κᵃ = λ * (σᵃ + ϕ)

	Γ = (1 + ϕ) / (σᵃ + ϕ)

	Ψ = -σᵃ * Θ / (σᵃ + ϕ)

end